<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"f7ffb5fe4585caaa95257826ad778ea7b41248cebc3f04be2bd48b86f819ff6b","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #633 at https://github.com/cal-itp/data-infra/actions/runs/17771572800","plan_out_hash":"8180a0c18d7fe25a2f35af6eaa844c49cdc05049ec9aa7a747ce1f04cb0f3a2d","plan_hash":"9f5405d110649abf97b863f44e8cfe6f3ff4ccd47e343b2fff20fa08f5c9dfad","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/create_external_tables/ntd_data_products/historical__major_safety_events.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "E5PdCQ==" -> (known after apply)
!~      detect_md5hash      = "JjV4YDCfcSmwlbTzHvM9KQ==" -> "different hash"
!~      generation          = 1751416673215652 -> (known after apply)
        id                  = "calitp-composer-dags/create_external_tables/ntd_data_products/historical__major_safety_events.yml"
!~      md5hash             = "JjV4YDCfcSmwlbTzHvM9KQ==" -> (known after apply)
        name                = "dags/create_external_tables/ntd_data_products/historical__major_safety_events.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/sync_ntd_data_api/safety_service_and_security_historical/major_safety_events.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "gdRF8g==" -> (known after apply)
!~      detect_md5hash      = "IUhAPOvqBfKXTpJRaz+KKQ==" -> "different hash"
!~      generation          = 1751997663026923 -> (known after apply)
        id                  = "calitp-composer-dags/sync_ntd_data_api/safety_service_and_security_historical/major_safety_events.yml"
!~      md5hash             = "IUhAPOvqBfKXTpJRaz+KKQ==" -> (known after apply)
        name                = "dags/sync_ntd_data_api/safety_service_and_security_historical/major_safety_events.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/sync_ntd_data_api/safety_service_and_security_historical/nonmajor_safety_and_security_events.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "EOeh1w==" -> (known after apply)
!~      detect_md5hash      = "u/WS3gWQKdIK3VZitwhz8g==" -> "different hash"
!~      generation          = 1751997661344259 -> (known after apply)
        id                  = "calitp-composer-dags/sync_ntd_data_api/safety_service_and_security_historical/nonmajor_safety_and_security_events.yml"
!~      md5hash             = "u/WS3gWQKdIK3VZitwhz8g==" -> (known after apply)
        name                = "dags/sync_ntd_data_api/safety_service_and_security_historical/nonmajor_safety_and_security_events.yml"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #633](https://github.com/cal-itp/data-infra/actions/runs/17771572800)